# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PaperSizeSet..::..Insert Method
PaperSizeSet Class See Also
---
Insert the specified item into the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	PaperSize item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	item As PaperSize _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	PaperSize^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..PaperSizeThe item to be inserted into the set.
# ### Return Value
Returns whether the item was inserted into the set.
# See Also
PaperSizeSet Class
Autodesk.Revit.DB Namespace